Revit 2024 API
ParameterTypeId.ViewScalePulldownMetric Property
 "View Scale"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewScalePulldownMetric { get; }
Visual Basic
Public Shared ReadOnly Property ViewScalePulldownMetric As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewScalePulldownMetric {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace